UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_tcp_server.c
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_timer.h"
#include "esp_heap_caps.h"
#include "hal/hal_net.h"
#include "MMBasic_Includes.h"
#include "Hardware_Includes.h"
#include "drivers/web_console/web_console_assets.h"
#include "drivers/web_console/web_console_display.h"
#include "drivers/web_console/web_console_input.h"
#include "drivers/web_console/web_console_protocol.h"
#include "drivers/web_console/web_console_transport.h"
#include "shared/net/mm_net_http.h"
#include "shared/net/mm_net_http_file.h"
#include "shared/net/mm_net_http_page.h"
#include "shared/net/mm_net_service.h"
#include "shared/net/mm_net_tcp_server_cmd.h"
#include "shared/net/mm_net_transmit_cmd.h"
#include "shared/net/mm_net_websocket.h"
#include "esp32_tcp_server.h"

#define ESP32_MAX_PCB      8
#define ESP32_TCP_RECV_BUF 2048
#define ESP32_TCP_PATH_MAX 128
#define ESP32_WEB_CONSOLE_RX_BUF 1024
#define ESP32_WEB_CONSOLE_PAYLOAD_LIMIT 512
#define ESP32_WEB_CONSOLE_TX_BUF 4096
#define ESP32_WEB_CONSOLE_SEND_CHUNK 4096
#define ESP32_WEB_CONSOLE_INPUT_QUEUE 128
#define ESP32_WEB_CONSOLE_FRAME_INTERVAL_US 33333LL
#define ESP32_WEB_CONSOLE_MAX_MISSED_FRAMES 6

typedef enum {
    ESP32_WEB_TX_IDLE = 0,
    ESP32_WEB_TX_BUFFER_WS_HEADER,
    ESP32_WEB_TX_BUFFER_PAYLOAD,
} esp32_web_console_tx_kind_t;

extern volatile bool TCPreceived;
extern char *TCPreceiveInterrupt;

static mm_net_tcp_service_t s_tcp;
static mm_net_tcp_service_slot_t s_tcp_slots[ESP32_MAX_PCB];
static uint8_t s_tcp_recv_buf[ESP32_MAX_PCB][ESP32_TCP_RECV_BUF];
static char s_tcp_path[ESP32_MAX_PCB][ESP32_TCP_PATH_MAX];
static uint8_t s_tcp_accept_buf[ESP32_TCP_RECV_BUF];

typedef struct {
    hal_net_tcp_conn_t conn;
    uint8_t rx_buf[ESP32_WEB_CONSOLE_RX_BUF];
    size_t rx_len;
    esp32_web_console_tx_kind_t tx_kind;
    uint8_t ws_header[10];
    size_t ws_header_len;
    size_t ws_header_off;
    uint8_t *frame_payload;
    size_t frame_payload_cap;
    size_t frame_payload_len;
    size_t frame_payload_off;
    uint8_t pending_pong[125];
    size_t pending_pong_len;
    int pending_pong_valid;
    int64_t next_frame_us;
    int64_t tx_started_us;
    unsigned missed_frames;
} esp32_web_console_ws_t;

static esp32_web_console_ws_t s_web_console_ws;
static uint8_t s_web_console_tx_buf[ESP32_WEB_CONSOLE_TX_BUF];
static uint8_t s_web_console_input_buf[ESP32_WEB_CONSOLE_INPUT_QUEUE];
static web_console_input_t s_web_console_input;

extern web_console_display_t *esp32_web_console_display(void);

static void esp32_web_console_input_init_once(void)
{
    static int inited;
    if (inited) return;
    inited = 1;
    web_console_input_init(&s_web_console_input, s_web_console_input_buf,
                           sizeof s_web_console_input_buf);
}

static void esp32_tcp_init_slots(void)
{
    static int inited;
    if (inited) return;
    inited = 1;
    esp32_web_console_input_init_once();
    for (int i = 0; i < ESP32_MAX_PCB; i++) {
        mm_net_tcp_service_slot_init(&s_tcp_slots[i], s_tcp_recv_buf[i],
                                     sizeof s_tcp_recv_buf[i], s_tcp_path[i],
                                     sizeof s_tcp_path[i]);
    }
    mm_net_tcp_service_init(&s_tcp, s_tcp_slots, ESP32_MAX_PCB);
}

static void esp32_tcp_close_slot(int pcb)
{
    esp32_tcp_init_slots();
    mm_net_tcp_service_close_slot(&s_tcp, pcb);
}

static int esp32_tcp_find_free_slot(void)
{
    for (int i = 0; i < ESP32_MAX_PCB; i++) {
        if (!s_tcp_slots[i].conn && !s_tcp_slots[i].inttrig) return i;
    }
    return -1;
}

static void esp32_tcp_refresh_received(void)
{
    TCPreceived = mm_net_tcp_service_interrupt_pending(&s_tcp) ? true : false;
}

static int esp32_conn_send_cb(void *ctx, const void *buf, size_t len)
{
    hal_net_tcp_conn_t conn = *(hal_net_tcp_conn_t *)ctx;
    return hal_net_tcp_conn_send(conn, buf, len, 5000) == HAL_NET_OK;
}

static void esp32_send_http_status_conn(hal_net_tcp_conn_t conn, int status)
{
    const char *reason = mm_net_http_status_reason(status);
    char body[96];
    int body_len = mm_net_http_format_status_body(body, sizeof body,
                                                  status, reason);
    if (body_len >= 0) {
        (void)mm_net_http_send_response(status, reason, "text/plain", body,
                                        (size_t)body_len, "MMBasic-ESP32",
                                        esp32_conn_send_cb, &conn);
    }
    hal_net_tcp_conn_close(conn);
}

static void esp32_send_asset_conn(hal_net_tcp_conn_t conn,
                                  const web_console_asset_t *asset)
{
    if (asset) {
        (void)mm_net_http_send_response(200, NULL, asset->content_type,
                                        asset->data, asset->len,
                                        "MMBasic-ESP32",
                                        esp32_conn_send_cb, &conn);
    }
    hal_net_tcp_conn_close(conn);
}

static int esp32_path_has_prefix(const char *path, const char *prefix)
{
    size_t n = strlen(prefix);
    return path && strncmp(path, prefix, n) == 0;
}

static int esp32_path_equals_ignore_query(const char *path, const char *want)
{
    if (!path || !want) return 0;
    size_t n = 0;
    while (path[n] && path[n] != '?') n++;
    return strlen(want) == n && memcmp(path, want, n) == 0;
}

static void esp32_web_console_close_reason(const char *reason)
{
    (void)reason;
    hal_net_tcp_conn_t conn = s_web_console_ws.conn;
    uint8_t *frame_payload = s_web_console_ws.frame_payload;
    size_t frame_payload_cap = s_web_console_ws.frame_payload_cap;
    if (conn) {
        web_console_input_release(&s_web_console_input, (uintptr_t)conn);
        hal_net_tcp_conn_close(conn);
    }
    memset(&s_web_console_ws, 0, sizeof s_web_console_ws);
    s_web_console_ws.frame_payload = frame_payload;
    s_web_console_ws.frame_payload_cap = frame_payload_cap;
}

static void esp32_web_console_close(void)
{
    esp32_web_console_close_reason("close");
}

static int esp32_web_console_send_frame(uint8_t opcode, const void *payload,
                                        size_t payload_len)
{
    if (!s_web_console_ws.conn) return WEB_CONSOLE_TRANSPORT_CLOSED;
    if (s_web_console_ws.tx_kind != ESP32_WEB_TX_IDLE) {
        return WEB_CONSOLE_TRANSPORT_BACKPRESSURE;
    }
    size_t written = 0;
    int rc = mm_net_ws_encode_frame(opcode, payload, payload_len,
                                    s_web_console_tx_buf,
                                    sizeof s_web_console_tx_buf, &written);
    if (rc != MM_NET_WS_OK) return WEB_CONSOLE_TRANSPORT_ERROR;
    size_t sent = 0;
    if (hal_net_tcp_conn_send_some(s_web_console_ws.conn,
                                   s_web_console_tx_buf, written,
                                   &sent) != HAL_NET_OK || sent != written) {
        esp32_web_console_close_reason("send_frame");
        return WEB_CONSOLE_TRANSPORT_CLOSED;
    }
    return WEB_CONSOLE_TRANSPORT_OK;
}

static void esp32_web_console_send_text(const char *text)
{
    if (text) {
        (void)esp32_web_console_send_frame(MM_NET_WS_OPCODE_TEXT, text,
                                           strlen(text));
    }
}

static void esp32_web_console_send_hello(void)
{
    esp32_web_console_send_text(
        "{\"op\":\"hello\",\"protocol\":1,\"target\":\"esp32_s3_metro\","
        "\"caps\":[\"status\",\"control\",\"display\",\"keyboard\"],"
        "\"display\":true,\"audio\":false,\"keyboard\":true}");
}

static void esp32_web_console_send_status(void)
{
    char json[192];
    int n = snprintf(json, sizeof json,
                     "{\"op\":\"status\",\"phase\":5,\"ws\":\"connected\","
                     "\"display\":\"ready\",\"audio\":\"pending\","
                     "\"keyboard\":\"ready\",\"input_owner\":%s,"
                     "\"input_dropped\":%u}",
                     web_console_input_owner(&s_web_console_input) ==
                         (uintptr_t)s_web_console_ws.conn ? "true" : "false",
                     s_web_console_input.dropped);
    if (n > 0 && (size_t)n < sizeof json) esp32_web_console_send_text(json);
}

