UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_tcp_server.c
static void put_u16_le(uint8_t *dst, uint16_t v)
{
    dst[0] = (uint8_t)(v & 0xffu);
    dst[1] = (uint8_t)((v >> 8) & 0xffu);
}

static void put_u64_be(uint8_t *dst, uint64_t v)
{
    for (int i = 0; i < 8; ++i) dst[7 - i] = (uint8_t)(v >> (i * 8));
}

static void put_i16_le(uint8_t *dst, int16_t v)
{
    put_u16_le(dst, (uint16_t)v);
}

static uint8_t esp32_web_console_rgb332(uint32_t c)
{
    uint8_t r = (uint8_t)((c >> 16) & 0xffu);
    uint8_t g = (uint8_t)((c >> 8) & 0xffu);
    uint8_t b = (uint8_t)(c & 0xffu);
    return (uint8_t)((r & 0xe0u) | ((g & 0xe0u) >> 3) | (b >> 6));
}

static size_t esp32_web_console_rle332_len(const web_console_display_t *display,
                                           int x1, int y1, int w, int h)
{
    size_t len = 0;
    uint8_t last = 0;
    uint16_t run = 0;

    for (int yy = 0; yy < h; ++yy) {
        const uint32_t *row = display->pixels +
            (size_t)(y1 + yy) * (size_t)display->width + (size_t)x1;
        for (int xx = 0; xx < w; ++xx) {
            uint8_t c = esp32_web_console_rgb332(row[xx]);
            if (run && c == last && run < 65535u) {
                run++;
            } else {
                if (run) len += 3u;
                last = c;
                run = 1;
            }
        }
    }
    if (run) len += 3u;
    return len;
}

static int esp32_web_console_ensure_payload(size_t need)
{
    if (s_web_console_ws.frame_payload_cap >= need) return 1;
    size_t cap = need;
    uint8_t *p = (uint8_t *)heap_caps_realloc(
        s_web_console_ws.frame_payload, cap,
        MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!p && !s_web_console_ws.frame_payload) p = (uint8_t *)malloc(cap);
    if (!p) return 0;
    s_web_console_ws.frame_payload = p;
    s_web_console_ws.frame_payload_cap = cap;
    return 1;
}

static uint8_t *esp32_web_console_pack_rle332(uint8_t *p,
                                              const web_console_display_t *display,
                                              int x1, int y1, int w, int h)
{
    uint8_t last = 0;
    uint16_t run = 0;

    for (int yy = 0; yy < h; ++yy) {
        const uint32_t *row = display->pixels +
            (size_t)(y1 + yy) * (size_t)display->width + (size_t)x1;
        for (int xx = 0; xx < w; ++xx) {
            uint8_t c = esp32_web_console_rgb332(row[xx]);
            if (run && c == last && run < 65535u) {
                run++;
            } else {
                if (run) {
                    put_u16_le(p, run);
                    p[2] = last;
                    p += 3;
                }
                last = c;
                run = 1;
            }
        }
    }
    if (run) {
        put_u16_le(p, run);
        p[2] = last;
        p += 3;
    }
    return p;
}

static void esp32_web_console_make_ws_binary_header(uint64_t payload_len)
{
    s_web_console_ws.ws_header[0] = 0x80u | MM_NET_WS_OPCODE_BINARY;
    if (payload_len <= 125u) {
        s_web_console_ws.ws_header[1] = (uint8_t)payload_len;
        s_web_console_ws.ws_header_len = 2;
    } else if (payload_len <= 65535u) {
        s_web_console_ws.ws_header[1] = 126u;
        s_web_console_ws.ws_header[2] = (uint8_t)(payload_len >> 8);
        s_web_console_ws.ws_header[3] = (uint8_t)payload_len;
        s_web_console_ws.ws_header_len = 4;
    } else {
        s_web_console_ws.ws_header[1] = 127u;
        put_u64_be(s_web_console_ws.ws_header + 2, payload_len);
        s_web_console_ws.ws_header_len = 10;
    }
    s_web_console_ws.ws_header_off = 0;
}

static int esp32_web_console_start_blit(web_console_display_t *display,
                                        int x1, int y1, int x2, int y2)
{
    if (!s_web_console_ws.conn || !display) return 0;
    if (x1 < 0) x1 = 0;
    if (y1 < 0) y1 = 0;
    if (x2 >= display->width) x2 = display->width - 1;
    if (y2 >= display->height) y2 = display->height - 1;
    if (x1 > x2 || y1 > y2) return 0;
    int w = x2 - x1 + 1;
    int h = y2 - y1 + 1;
    size_t rle_len = esp32_web_console_rle332_len(display, x1, y1, w, h);
    size_t payload_len = WEB_CONSOLE_FRAME_HEADER_LEN + 9u + rle_len;
    if (!esp32_web_console_ensure_payload(payload_len)) return 0;

    uint8_t *p = s_web_console_ws.frame_payload;
    memcpy(p, "CMDS", 4);
    put_u16_le(p + 4, (uint16_t)display->width);
    put_u16_le(p + 6, (uint16_t)display->height);
    p += WEB_CONSOLE_FRAME_HEADER_LEN;
    *p++ = WEB_CONSOLE_OP_BLIT_RGB332_RLE;
    put_i16_le(p, (int16_t)x1);
    put_i16_le(p + 2, (int16_t)y1);
    put_u16_le(p + 4, (uint16_t)w);
    put_u16_le(p + 6, (uint16_t)h);
    p += 8;
    p = esp32_web_console_pack_rle332(p, display, x1, y1, w, h);
    s_web_console_ws.frame_payload_len =
        (size_t)(p - s_web_console_ws.frame_payload);
    s_web_console_ws.frame_payload_off = 0;
    esp32_web_console_make_ws_binary_header(s_web_console_ws.frame_payload_len);

    s_web_console_ws.tx_started_us = esp_timer_get_time();
    s_web_console_ws.missed_frames = 0;
    s_web_console_ws.tx_kind = ESP32_WEB_TX_BUFFER_WS_HEADER;
    return 1;
}

static int esp32_web_console_send_raw_progress(const uint8_t *buf, size_t len,
                                               size_t *off)
{
    if (!s_web_console_ws.conn) return -1;
    if (*off >= len) return 1;
    size_t n = len - *off;
    if (n > ESP32_WEB_CONSOLE_SEND_CHUNK) n = ESP32_WEB_CONSOLE_SEND_CHUNK;
    size_t sent = 0;
    int rc = hal_net_tcp_conn_send_some(s_web_console_ws.conn, buf + *off,
                                        n, &sent);
    if (rc == HAL_NET_TIMEOUT || rc == HAL_NET_WOULD_BLOCK) return 0;
    if (rc != HAL_NET_OK) {
        esp32_web_console_close_reason("send_raw");
        return -1;
    }
    if (sent == 0) return 0;
    *off += sent;
    return *off >= len ? 1 : 0;
}

static int esp32_web_console_progress_buffer(void)
{
    if (s_web_console_ws.tx_kind == ESP32_WEB_TX_BUFFER_WS_HEADER) {
        int rc = esp32_web_console_send_raw_progress(
            s_web_console_ws.ws_header, s_web_console_ws.ws_header_len,
            &s_web_console_ws.ws_header_off);
        if (rc <= 0) return rc;
        s_web_console_ws.tx_kind = ESP32_WEB_TX_BUFFER_PAYLOAD;
    }
    if (s_web_console_ws.tx_kind == ESP32_WEB_TX_BUFFER_PAYLOAD) {
        int rc = esp32_web_console_send_raw_progress(
            s_web_console_ws.frame_payload,
            s_web_console_ws.frame_payload_len,
            &s_web_console_ws.frame_payload_off);
        if (rc <= 0) return rc;
        s_web_console_ws.tx_kind = ESP32_WEB_TX_IDLE;
        s_web_console_ws.tx_started_us = 0;
        s_web_console_ws.missed_frames = 0;
    }
    return 1;
}

