UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_tcp_server.c
static int esp32_web_console_progress_tx(web_console_display_t *display)
{
    (void)display;
    if (s_web_console_ws.tx_kind == ESP32_WEB_TX_BUFFER_WS_HEADER ||
        s_web_console_ws.tx_kind == ESP32_WEB_TX_BUFFER_PAYLOAD)
        return esp32_web_console_progress_buffer();
    return 1;
}

static void esp32_web_console_start_frmb_and_clear_dirty(
    web_console_display_t *display)
{
    if (!display) return;
    if (!esp32_web_console_start_blit(display, 0, 0,
                                      display->width - 1,
                                      display->height - 1)) return;
    web_console_display_clear_dirty(display);
    s_web_console_ws.next_frame_us =
        esp_timer_get_time() + ESP32_WEB_CONSOLE_FRAME_INTERVAL_US;
}

static void esp32_web_console_start_blit_and_clear_dirty(
    web_console_display_t *display, int x1, int y1, int x2, int y2)
{
    if (!esp32_web_console_start_blit(display, x1, y1, x2, y2)) return;
    web_console_display_clear_dirty(display);
    s_web_console_ws.next_frame_us =
        esp_timer_get_time() + ESP32_WEB_CONSOLE_FRAME_INTERVAL_US;
}

static void esp32_web_console_drain_display(void)
{
    web_console_display_t *display = esp32_web_console_display();
    if (!s_web_console_ws.conn || !display) return;

    if (s_web_console_ws.tx_kind != ESP32_WEB_TX_IDLE) {
        int x1, y1, x2, y2;
        if (web_console_display_dirty_bounds(display, &x1, &y1, &x2, &y2)) {
            int64_t now = esp_timer_get_time();
            if (s_web_console_ws.next_frame_us == 0) {
                s_web_console_ws.next_frame_us =
                    now + ESP32_WEB_CONSOLE_FRAME_INTERVAL_US;
            }
            while (now >= s_web_console_ws.next_frame_us) {
                s_web_console_ws.missed_frames++;
                s_web_console_ws.next_frame_us +=
                    ESP32_WEB_CONSOLE_FRAME_INTERVAL_US;
            }
            if (s_web_console_ws.missed_frames >=
                ESP32_WEB_CONSOLE_MAX_MISSED_FRAMES) {
                web_console_display_request_resync(display);
            }
        }
        (void)esp32_web_console_progress_tx(display);
        return;
    }
    if (s_web_console_ws.pending_pong_valid) {
        size_t len = s_web_console_ws.pending_pong_len;
        s_web_console_ws.pending_pong_valid = 0;
        (void)esp32_web_console_send_frame(MM_NET_WS_OPCODE_PONG,
                                           s_web_console_ws.pending_pong,
                                           len);
        if (!s_web_console_ws.conn) return;
    }
    if (web_console_display_take_resync(display)) {
        esp32_web_console_start_frmb_and_clear_dirty(display);
        (void)esp32_web_console_progress_tx(display);
        return;
    }

    int x1, y1, x2, y2;
    if (!web_console_display_dirty_bounds(display, &x1, &y1, &x2, &y2)) {
        return;
    }

    int64_t now = esp_timer_get_time();
    if (s_web_console_ws.next_frame_us == 0) {
        s_web_console_ws.next_frame_us = now + ESP32_WEB_CONSOLE_FRAME_INTERVAL_US;
        return;
    }
    if (now < s_web_console_ws.next_frame_us) return;

    esp32_web_console_start_blit_and_clear_dirty(display, x1, y1, x2, y2);
    (void)esp32_web_console_progress_tx(display);
}

static int esp32_json_op_is(const uint8_t *payload, size_t len,
                            const char *op)
{
    const char needle[] = "\"op\"";
    const uint8_t *end = payload + len;
    const uint8_t *p = payload;
    while (p + sizeof(needle) - 1u <= end) {
        if (memcmp(p, needle, sizeof(needle) - 1u) == 0) {
            p += sizeof(needle) - 1u;
            while (p < end && (*p == ' ' || *p == '\t' || *p == '\r' ||
                               *p == '\n')) p++;
            if (p >= end || *p++ != ':') return 0;
            while (p < end && (*p == ' ' || *p == '\t' || *p == '\r' ||
                               *p == '\n')) p++;
            if (p >= end || *p++ != '"') return 0;
            size_t op_len = strlen(op);
            return (size_t)(end - p) >= op_len + 1u &&
                   memcmp(p, op, op_len) == 0 && p[op_len] == '"';
        }
        p++;
    }
    return 0;
}

static void esp32_web_console_handle_text(const uint8_t *payload,
                                          size_t payload_len)
{
    int key_code = -1;
    if (web_console_parse_key_json((const char *)payload, payload_len,
                                   &key_code)) {
        if (BreakKey && key_code == BreakKey) {
            MMAbort = 1;
            ConsoleRxBufHead = ConsoleRxBufTail;
            web_console_input_clear(&s_web_console_input);
        } else if (key_code == keyselect && KeyInterrupt != NULL) {
            Keycomplete = 1;
        } else {
            (void)web_console_input_push(&s_web_console_input,
                                         (uintptr_t)s_web_console_ws.conn,
                                         key_code);
        }
        return;
    }
    if (esp32_json_op_is(payload, payload_len, "hello")) {
        esp32_web_console_send_hello();
        esp32_web_console_send_status();
        return;
    }
    if (esp32_json_op_is(payload, payload_len, "status")) {
        esp32_web_console_send_status();
    }
}

static void esp32_web_console_send_close(uint16_t code)
{
    uint8_t payload[2] = {
        (uint8_t)(code >> 8),
        (uint8_t)(code & 0xffu),
    };
    (void)esp32_web_console_send_frame(MM_NET_WS_OPCODE_CLOSE, payload,
                                       sizeof payload);
    esp32_web_console_close_reason("ws_close");
}

static void esp32_web_console_process_rx(void)
{
    uint8_t payload[ESP32_WEB_CONSOLE_PAYLOAD_LIMIT];
    for (;;) {
        mm_net_ws_frame_t frame;
        size_t consumed = 0;
        int rc = mm_net_ws_decode_frame(s_web_console_ws.rx_buf,
                                        s_web_console_ws.rx_len,
                                        ESP32_WEB_CONSOLE_PAYLOAD_LIMIT,
                                        payload, sizeof payload, &frame,
                                        &consumed);
        if (rc == MM_NET_WS_NEED_MORE) return;
        if (rc != MM_NET_WS_OK || consumed == 0) {
            esp32_web_console_send_close(
                rc == MM_NET_WS_ERR_TOO_LARGE ? 1009u : 1002u);
            return;
        }
        if (consumed < s_web_console_ws.rx_len) {
            memmove(s_web_console_ws.rx_buf,
                    s_web_console_ws.rx_buf + consumed,
                    s_web_console_ws.rx_len - consumed);
        }
        s_web_console_ws.rx_len -= consumed;

        if (frame.opcode == MM_NET_WS_OPCODE_TEXT) {
            esp32_web_console_handle_text(payload, frame.payload_len);
        } else if (frame.opcode == MM_NET_WS_OPCODE_PING) {
            if (s_web_console_ws.tx_kind == ESP32_WEB_TX_IDLE) {
                (void)esp32_web_console_send_frame(MM_NET_WS_OPCODE_PONG,
                                                   payload, frame.payload_len);
            } else if (frame.payload_len <= sizeof s_web_console_ws.pending_pong) {
                memcpy(s_web_console_ws.pending_pong, payload,
                       frame.payload_len);
                s_web_console_ws.pending_pong_len = frame.payload_len;
                s_web_console_ws.pending_pong_valid = 1;
            }
        } else if (frame.opcode == MM_NET_WS_OPCODE_CLOSE) {
            esp32_web_console_send_close(frame.close_code ?
                                         frame.close_code : 1000u);
            return;
        }
        if (!s_web_console_ws.conn || s_web_console_ws.rx_len == 0) return;
    }
}

static void esp32_web_console_poll(void)
{
    if (!s_web_console_ws.conn) return;
    for (;;) {
        if (s_web_console_ws.rx_len >= sizeof s_web_console_ws.rx_buf) {
            esp32_web_console_send_close(1009u);
            return;
        }
        size_t len = 0;
        int rc = hal_net_tcp_conn_recv(
            s_web_console_ws.conn,
            s_web_console_ws.rx_buf + s_web_console_ws.rx_len,
            sizeof s_web_console_ws.rx_buf - s_web_console_ws.rx_len, &len);
        if (rc == HAL_NET_WOULD_BLOCK) {
            esp32_web_console_drain_display();
            return;
        }
        if (rc != HAL_NET_OK) {
            esp32_web_console_close_reason("recv_error");
            return;
        }
        if (len == 0) {
            esp32_web_console_drain_display();
            return;
        }
        s_web_console_ws.rx_len += len;
        esp32_web_console_process_rx();
        if (!s_web_console_ws.conn) return;
    }
}

static int esp32_web_console_accept_ws(hal_net_tcp_conn_t conn,
                                       const uint8_t *request,
                                       size_t request_len)
{
    char key[MM_NET_WS_MAX_KEY_LEN];
    int rc = mm_net_ws_validate_upgrade_request(request, request_len,
                                                WEB_CONSOLE_WS_PATH, key);
    if (rc != MM_NET_WS_OK) {
        esp32_send_http_status_conn(conn, 400);
        return 1;
    }

    if (s_web_console_ws.conn) {
        esp32_web_console_close_reason("ws_replace");
    }

    if (!web_console_input_acquire(&s_web_console_input, (uintptr_t)conn)) {
        esp32_send_http_status_conn(conn, 403);
        return 1;
    }

    char accept[MM_NET_WS_ACCEPT_LEN];
    char response[256];
    rc = mm_net_ws_compute_accept(key, accept);
    if (rc == MM_NET_WS_OK) {
        rc = mm_net_ws_format_upgrade_response(response, sizeof response,
                                               accept);
    }
    if (rc < 0 || hal_net_tcp_conn_send(conn, response, (size_t)rc, 5000) !=
        HAL_NET_OK) {
        web_console_input_release(&s_web_console_input, (uintptr_t)conn);
        hal_net_tcp_conn_close(conn);
        return 1;
    }

    memset(&s_web_console_ws, 0, sizeof s_web_console_ws);
    s_web_console_ws.conn = conn;
    esp32_web_console_send_hello();
    esp32_web_console_send_status();
    web_console_display_t *display = esp32_web_console_display();
    if (display) web_console_display_request_resync(display);
    esp32_web_console_drain_display();
    return 1;
}

static int esp32_web_console_handle_request(hal_net_tcp_conn_t conn,
                                            const uint8_t *request,
                                            size_t request_len,
                                            const char *path)
{
    if (esp32_path_equals_ignore_query(path, WEB_CONSOLE_WS_PATH)) {
        return esp32_web_console_accept_ws(conn, request, request_len);
    }

    const web_console_asset_t *asset = web_console_asset_find(path);
    if (asset) {
        esp32_send_asset_conn(conn, asset);
        return 1;
    }

    if (esp32_path_has_prefix(path, "/__web_console")) {
        esp32_send_http_status_conn(conn, 404);
        return 1;
    }

