UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_tcp_server.c
    return 0;
}

int esp32_tcp_interrupt_pending(void)
{
    esp32_tcp_init_slots();
    return mm_net_tcp_service_interrupt_pending(&s_tcp);
}

int esp32_web_console_input_available(void)
{
    esp32_tcp_init_slots();
    return web_console_input_available(&s_web_console_input);
}

int esp32_web_console_pop_key(void)
{
    int code = -1;
    esp32_tcp_init_slots();
    if (!web_console_input_pop(&s_web_console_input, &code)) return -1;
    return code;
}

int esp32_web_console_connected(void)
{
    esp32_tcp_init_slots();
    return s_web_console_ws.conn != 0;
}

void esp32_tcp_server_poll(void)
{
    esp32_tcp_init_slots();
    esp32_web_console_poll();
    if (!s_tcp.server) return;

    for (;;) {
        hal_net_tcp_conn_t conn = 0;
        size_t len = 0;
        int rc = hal_net_tcp_accept_event(s_tcp.server, &conn,
                                          s_tcp_accept_buf,
                                          sizeof s_tcp_accept_buf, &len);
        if (rc == HAL_NET_WOULD_BLOCK) return;
        if (rc != HAL_NET_OK || !conn) return;
        if (len == 0) {
            hal_net_tcp_conn_close(conn);
            continue;
        }

        char path[ESP32_TCP_PATH_MAX];
        mm_net_http_extract_path(s_tcp_accept_buf, len, path, sizeof path);
        if (esp32_web_console_handle_request(conn, s_tcp_accept_buf, len,
                                             path)) {
            esp32_tcp_refresh_received();
            continue;
        }

        int pcb = esp32_tcp_find_free_slot();
        if (pcb < 0) {
            hal_net_tcp_conn_close(conn);
            continue;
        }
        mm_net_tcp_service_slot_t *slot = &s_tcp_slots[pcb];
        slot->conn = conn;
        slot->recv_len = len;
        memcpy(slot->recv_buf, s_tcp_accept_buf, len);
        if (slot->path && slot->path_cap) {
            memcpy(slot->path, path, strlen(path) + 1u);
        }
        slot->inttrig = 1;
        TCPreceived = true;
    }
}

void esp32_tcp_server_stop(void)
{
    esp32_tcp_init_slots();
    esp32_web_console_close_reason("server_stop");
    mm_net_tcp_service_stop(&s_tcp);
}

int esp32_tcp_server_open(uint16_t port)
{
    esp32_tcp_init_slots();
    if (!port) return 0;
    if (s_tcp.server && s_tcp.port != (int)port)
        esp32_web_console_close_reason("port_change");
    return mm_net_tcp_service_open(&s_tcp, port, ESP32_MAX_PCB);
}

void esp32_tcp_server_clear_requests(void)
{
    esp32_tcp_init_slots();
    mm_net_tcp_service_clear_requests(&s_tcp);
}

int esp32_tcp_server_max_connections(void)
{
    return ESP32_MAX_PCB;
}

int esp32_tcp_server_request_pending(int pcb)
{
    esp32_tcp_init_slots();
    return mm_net_tcp_service_request_pending(&s_tcp, pcb);
}

const char *esp32_tcp_server_path(int pcb)
{
    esp32_tcp_init_slots();
    return mm_net_tcp_service_path(&s_tcp, pcb);
}

static int esp32_http_send_cb(void *ctx, const void *buf, size_t len)
{
    int pcb = *(int *)ctx;
    if (!mm_net_tcp_service_conn(&s_tcp, pcb)) return 0;
    return mm_net_tcp_service_send(&s_tcp, pcb, buf, len, 5000) ==
           HAL_NET_OK;
}

static void esp32_tcp_send_http_buffer(int pcb, const char *ctype,
                                       const uint8_t *buf, size_t len)
{
    if (!mm_net_tcp_service_conn(&s_tcp, pcb)) error("Not connected");
    if (mm_net_http_send_response(200, NULL, ctype, buf, len,
                                  "MMBasic-ESP32", esp32_http_send_cb,
                                  &pcb) != 0) {
        error("Transmit failed");
    }
    esp32_tcp_close_slot(pcb);
}

static void esp32_tcp_send_status(int pcb, int status)
{
    if (!mm_net_tcp_service_conn(&s_tcp, pcb)) error("Not connected");
    const char *reason = mm_net_http_status_reason(status);

    char body[96];
    int body_len = mm_net_http_format_status_body(body, sizeof body,
                                                  status, reason);
    if (body_len < 0) error("Output buffer too small");
    if (mm_net_http_send_response(status, reason, "text/plain", body,
                                  (size_t)body_len, "MMBasic-ESP32",
                                  esp32_http_send_cb, &pcb) != 0) {
        error("Transmit failed");
    }
    esp32_tcp_close_slot(pcb);
}

static void esp32_tcp_transmit_file(int pcb, const char *fname,
                                    const char *ctype)
{
    if (!mm_net_tcp_service_conn(&s_tcp, pcb)) error("Not connected");
    if (!fname || !*fname) error("Cannot find file");

    int rc = mm_net_http_send_file(fname, ctype, "MMBasic-ESP32",
                                   esp32_http_send_cb, &pcb);
    if (rc == -1) {
        esp32_tcp_send_status(pcb, 404);
        return;
    }
    esp32_tcp_close_slot(pcb);
}

static void esp32_tcp_transmit_page(int pcb, const char *fname, int extra)
{
    if (!mm_net_tcp_service_conn(&s_tcp, pcb)) error("Not connected");
    if (!fname || !*fname) error("Cannot find file");
    if (extra < 0) error("Syntax");

    char *out = NULL;
    size_t len = 0;
    int rc = mm_net_http_render_page(fname, extra, &out, &len);
    if (rc == -1) {
        esp32_tcp_send_status(pcb, 404);
        return;
    }
    if (rc != 0) {
        esp32_tcp_send_status(pcb, 500);
        return;
    }

    esp32_tcp_send_http_buffer(pcb, "text/html", (const uint8_t *)out, len);
    FreeMemory((unsigned char *)out);
}

int esp32_transmit_cmd(unsigned char *tp)
{
    mm_net_transmit_args_t parsed;
    if (!mm_net_transmit_parse(tp, ESP32_MAX_PCB, &parsed)) return 0;

    switch (parsed.kind) {
        case MM_NET_TRANSMIT_CODE:
            esp32_tcp_send_status(parsed.pcb, parsed.status);
            return 1;
        case MM_NET_TRANSMIT_FILE:
        case MM_NET_TRANSMIT_CSS:
        case MM_NET_TRANSMIT_JS:
        case MM_NET_TRANSMIT_IMAGE:
            esp32_tcp_transmit_file(parsed.pcb, parsed.filename,
                                    parsed.content_type);
            return 1;
        case MM_NET_TRANSMIT_PAGE:
            esp32_tcp_transmit_page(parsed.pcb, parsed.filename, parsed.extra);
            return 1;
        default:
            return 0;
    }
}

int esp32_tcp_cmd(unsigned char *tp)
{
    unsigned char *arg;

