UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_tcp_server.c
    arg = checkstring(tp, (unsigned char *)"INTERRUPT");
    if (arg) {
        TCPreceiveInterrupt = mm_net_tcp_server_parse_interrupt(arg);
        InterruptUsed = true;
        TCPreceived = false;
        return 1;
    }

    arg = checkstring(tp, (unsigned char *)"CLOSE");
    if (arg) {
        mm_net_tcp_server_slot_args_t parsed;
        mm_net_tcp_server_parse_slot(arg, ESP32_MAX_PCB, &parsed);
        esp32_tcp_close_slot(parsed.pcb);
        return 1;
    }

    arg = checkstring(tp, (unsigned char *)"READ");
    if (arg) {
        mm_net_tcp_server_read_args_t parsed;
        mm_net_tcp_server_parse_read(arg, ESP32_MAX_PCB, &parsed);
        ProcessWeb(0);
        int rc = mm_net_tcp_service_read(&s_tcp, parsed.pcb, parsed.dest,
                                         parsed.buffer,
                                         (size_t)parsed.payload_capacity,
                                         (size_t)parsed.array_bytes);
        if (rc == HAL_NET_WOULD_BLOCK) return 1;
        if (rc != HAL_NET_OK) error("array too small");
        return 1;
    }

    arg = checkstring(tp, (unsigned char *)"SEND");
    if (arg) {
        mm_net_tcp_server_send_args_t parsed;
        mm_net_tcp_server_parse_send(arg, ESP32_MAX_PCB, &parsed);
        if (!mm_net_tcp_service_conn(&s_tcp, parsed.pcb))
            error("Not connected");
        if (mm_net_tcp_service_send(&s_tcp, parsed.pcb, parsed.payload,
                                    parsed.payload_len, 5000) != HAL_NET_OK)
            error("write failed");
        return 1;
    }

    return 0;
}
